/*Напишете програма за компютърен вариант на играта "Бесеница". В тази игра на играча се показва дължината на определена дума (използват се подчертаващи тирета) и той се опитва да отгатне
думата като въвежда букви. При всяко въвеждане на нова буква се проверява дали думата съдържа тази буква. Ако това е така, съответната буква се показва. Бройте буквите, въведени до
завършване на думата. Играчът печели, ако познае думата с въвеждане на брой букви не повече от дължината на търсената дума+2 или по-малко от този брой.*/
#include <stdio.h>

int main(void)
{
    return 0;
}