/*Цецко е програмист и има хоби да прави сладкарски изделия. Помогнете му да напише програма, с която да менажира произведените сладка и техните доставки. За целта трябва да създадете
структура за продукт, която да описва име на продукта, цена и уникален номер. Създайте и структура за поръчки, която да описва адрес на клиент и номер на продукт. От стандартния вход
постъпват множество продукти и поръчки. Когато Цецко прави сладко той го добавя в списък на създадените сладка, а когато се пуска поръчка тя се изпълнява при наличие на продукт, иначе чака
до създаването му. За входни данни ще получавате две команди:
-> Product
<име на продукт>
<цена>
<номер на продукта>
- Тази команда създава нов продукт и го добавя в списъка с продукти. Ако има поръчка за този продукт, то поръчката се изпълнява незабавно и се маха от чакащите за изпълнение
-> Order
<адрес>
<номер на продукта>
- Ако има наличен вече произведен продукт се изпълнява поръчката, в противен случай чака за създаване на продукта.
При всяко изпълнение на поръчка изписвайте: Client <address> ordered <product name>. Програмата приключва работа при въвеждане на команда END.*/
#include <stdio.h>

struct Product {
    char productName[50];
    double productPrice;
    int productNumber;
};

struct Order {
    char clientAddress[50];
    int productNumber;
};