/*Учебна зала има правоъгълен размер w на h метра. Залата е разделена на 2 части - лява и дясна, с коридор приблизително по средата. В лявата и дясната част има редици с бюра. В задната
част на залата има голяма входна врата. В предната част на залата има катедра с подиум за преподавателя. Едно работно място заема 70 на 120cm. Коридорът е широк поне 100cm. Изчислено е, че
заради входната врата се губи точно 1 работно място, а заради катедрата се губят точно 2 работни места. Напишете програма, която прочита размерите на учебната зала и изчислява броя на
работните места в нея при описаното разположение.*/
#include <stdio.h>

int main(void)
{
    double w, h;
    printf("Enter hall's width: ");
    scanf("%lf", &w);
    printf("Enter hall's height: ");
    scanf("%lf", &h);

    double desk = 0.7 * 1.2;
    //double corridor = 1;

    int allDesks = (w * h - desk) - 3;
    printf("%d", allDesks);

    return 0;
}
