"""
Да се напише програма, която създава две множества от m цели числа, въведени от клавиатурата и извършва следните операции с тях:
определя размера на двете създадени множества, обединение на двете множества, разлика на двете множества,
премахване на избран елемент от първото множество и изчистване на двете множества.
"""
m1 = set(map(int, input("Въведете елементите на първото множество, разделени с интервали: ").split()))
m2 = set(map(int, input("Въведете елементите на второто множество, разделени с интервали: ").split()))

print("Размер на първото множество:", len(m1))
print("Размер на второто множество:", len(m2))

united = m1.union(m2)
print("Обединение на двете множества:", united)

diff = m1.difference(m2)
print("Разлика на първото множество с второто:", diff)

elementToRemove = int(input("Въведете елемент, който да бъде премахнат от първото множество: "))
m1.remove(elementToRemove)
print("Първото множество след премахване на елемента:", m1)

m1.clear()
m2.clear()
print("Първото множество след изчистване:", m1)
print("Второто множество след изчистване:", m2)
