"""
Напишете програма, в която потребителят трябва да въведе текстова стойност. На основата на текста се формира речник. Ключовете на речника са символите на този текст,
а стойността на съответния елемент представлява текста с "изтрит" символът, който се явява ключът.
(ключовете не трябва да се повтарят, ако има повтарящи се символи, те се пропускат).
"""
text = input("Дума: ")

dictionary = {}
for key in text:
    if key not in dictionary:
        new_text = text.replace(key, "")
        dictionary[key] = new_text
print(dictionary)
