/*Описание: Да се създаде конзолно приложение организатор на личен аудио каталог, в който може да има песни, музикални албуми, podcast-и,
аудиокнига и playlist-и. Всеки обект записан в приложението трябва да има жанр, продължителност, категория, автор и година на публикуване.
Приложението трябва да запазва и зарежда каталога във собствен формат файлове (бинарен, текстов, XML, json или друг по избор на студента). 
Приложението трябва да има следните функционалности: 
•   Добавяне на нов обект (може да бъде песен, podcast, аудиокнига и т.н.) 
•   Изтриване на обект
•   Търсене на обект по заглавие, изпълнител, жанр и т.н.
•   Създаване на playlist
•   Добавяне и триене на обекти от playlist
•   Връщане на информация за playlist, песен, албум и т.н.
•   Филтрация на обекти по жанр, автор,  година и т.н.
•   Сортиране на всички обекти по азбучен ред или като част от playlist
•   Записване и четене на всички обекти от каталога във файл 
•   Записване и четене на отделни playlist-и във файл*/

import java.util.ArrayList;
import java.util.List;

import Items.*;

public class Player {
    public static void main(String[] args) throws Exception {

    }
}
