"""
Напишишете програма речник, в който ключовете са фамилии на писатели, а стойностите техни произведения.
Обхождате речника, а на екрана се принтира автор и потребителя въвежда произведение, и ако отговора съвпада, верните отговори се увеличават. Накрая се принтират познатите.
"""
dictionary = {"Вазов": "Под игото", "Ботев": "Борба", "Константинов": "Бай Ганьо"}
points = 0
for key in dictionary.keys():
    print(key)
    creation = input()
    if creation == dictionary[key]:
        points += 1
print(points)
