# Променливи
# <име> = <стойност>
text = "Питон"  # текст -> може да се отбелязва с "" или ''
integer = 420  # цяло число
fractionalNumber = 6.9  # дробно число (реално число)

# Конкатенация
# -> Със знак +:
# => променливите трябва да са от един и същ тип; ако променливите са числа, знак + ще извърши събиране вместо конкатенация
print("Текст: " + text)
print("Текст: " + text + " + Цяло число: " + str(integer) + " + Дробно число: " + str(fractionalNumber))
# -> Със знак ,:
print("Цяло число:", integer)
print("Дробно число:", fractionalNumber)

print()  # НЕ е зададено нищо за отпечатване -> отпечатва празен ред

something = input("Въведи нещо: ")  # команда за четене от конзолата -> връща ни въведението от потребителя; можем още тук да вкараме текст преди отпечатването на променливата
print("Въведено: " + something)
number = int(input("Въведи число: "))
print("Въведоно число:", number)
floatingNumber = float(input("Въведи дробно число: "))  # въпреки че тази променлива е за дробни числа можем отново да въвеждаме цели такива
print("Въведоно дробно число:", floatingNumber)
# -> Чрез интерполация:
# <-> %-форматиране:
# => променливите се означават с букви s - текстове, d - цели числа, f - дробни числа
test = "Тест"
n1 = 2
n2 = 1.2
print("Начало на %s 1: Първо число: %d; Второ число: %.2f" % (test, n1, n2))  # .2f (:.2f в другите случаи) - закръгля дробното число до 2 знака след запетаята
# <-> {}-форманиране:
print("Начало на {} 2: Първо число: {:d}; Второ число: {:.2f}".format(test, n1, n2))
# <-> f-форманиране:
print(f"Начало на {test} 3: Първо число: {n1}; Второ число: {n2:.2f}")

print("------------------------------------------------------------------")

# Операции:
# -> Събиране:
number1 = 15
number2 = 7
sum1 = number1 + number2
print(f"Събиране: {sum1}")
# -> Изваждане:
sum2 = number1 - number2
print(f"Изваждане: {sum2}")
# -> Умножение:
sum3 = number1 * number2
print(f"Умножение: {sum3}")
# -> Деление:
# <-> Целочислено: Резултатът е цяло число
sum4 = number1 // number2
print(f"Целочислено деление: {sum4}")
# <-> Реално: Резултатът е число с подвижна запетая
sum5 = number1 / number2
print(f"Реално деление: {sum5}")
# <-> Модулно: Резултатът е остатъкът от делението
sum6 = number1 % number2
print(f"Модулно деление: {sum6}")
# -> Степенуване:
sum7 = number1 ** number2
print(f"Степенуване: {sum7}")

print("------------------------------------------------------------------")

# Оператори за сравнение: Връща True или False
# -> Равенство: ==
print(f"{number1} е равно на {number2} - {number1 == number2}")
# -> Различно: !=
print(f"{number1} е различно от {number2} - {number1 != number2}")
# -> По-голямо: >
print(f"{number1} е по-голямо от {number2} - {number1 > number2}")
# -> По-голямо или равно: >=
print(f"{number1} е по-голямо или равно на {number2} - {number1 >= number2}")
# -> По-малко: <
print(f"{number1} е по-малко от {number2} - {number1 < number2}")
# -> По-малко или равно: <=
print(f"{number1} е по-малко от {number2} - {number1 <= number2}")

print()

# Логически оператори:
# -> and - и - връща True, ако всички условия са True
print(f"{number} по-малко ли е от {number1} и {number2} - {number < number1 and number < number2}")
# -> or - или - връща True, ако поне едно условие е True
print(f"{number} по-голямо ли е от {number1} или от {n1} - {number > number1 or number > n1}")
# -> not - отрицание - ако отговорът е True го обръща във False
print(f"Обърни {number < number1 and number < number2} във {not (number < number1 and number < number2)}")

print()

# Оператори за идентичност: Сравнява дали обектите са един и същ обект(със същото място в паметта)
x = 1
y = 1
print(f"{x} e същото като {y} - {x is y}")  # връща True, ако променливите са един и същ обект
print(f"{x} не e същото като {y} - {x is not y}")  # връща True, ако променливите НЕ са един и същ обект

print()

# Оператори за членство: Проверява дали обектът е наличен
word = "Мой"
print(f"Думата {word} съдържа ли се в думата {text} - {word in text}")  # връща True, ако обектът е наличен
print(f"Думата {word} не се ли съдържа в думата {text} - {word not in text}")  # връща True, ако обектът НЕ е наличен

print("------------------------------------------------------------------")

# if - твърдения
num1 = 22
num2 = 11
if (num1 < num2):
    print(f"{num1} е по-малко от {num2}")
elif (num1 == num2):
    print(f"{num1} е равно на {num2}")
else:
    print(f"{num1} е по-голямо от {num2}")
# => ако кодът под if НЕ е с интервал навътре ще даде грешка

print(f"Думата 'Питон' съществува в {text}") if "Питон" in text else print(f"Думата 'Питон' не съществува в {text}")

print("------------------------------------------------------------------")

# Цикли:
# -> for - цикли
print("Принтирай буквите от думата банан:")
for i in "банан":
    print(i)

print()

for j in "банан":
    print(j)
    if (j == "н"):
        break  # приключва цикъла

print()

print("Числата от 2 до 10 през 2:")
for k in range(2, 10 + 1, 2):  # 1.начална стойност, 2.крайна стойност, 3.стъпка
    print(k, end = " ")  # параметър end = " " принтира числата едно след друго с интервал
print()  # задължително се слага след print с параметър end = " "

print()

print("Числата от 1 до 5:")
for l in range(6):
    print(l, end = " ")
else:
    print("- Цикълът приключи")

print()
# -> while цикли
m = 1
print("Числата от 1 до 6:")
while (m < 7):
    print(m, end = " ")
    m += 1
print()

print("------------------------------------------------------------------")

# Листове: елементите са подредени, могат да се променят и може да има повтарящи се елементи
myFirstList = ["Емилиян", "на", 19, "години", "е", "много", "готин", True]
print(myFirstList)
print(f"Има {len(myFirstList)} елемента в списъка")  # връща дължината на списъка
print(f"Първият елемент в списъка е: {myFirstList[0]}")  # достъпва елемент от списъка с индекс
# => индексирането започва от 0 до 7
print(f"Последният елемент в списъка е: {myFirstList[-1]}")
# => индексирането започва от -8 до -1
print(f"Всички елементи до 4 в списъка са: {myFirstList[:4]}")  # връща всички елементи до елемента с индекс 4, но без него
print(f"Всички елементи от 3 до края в списъка са: {myFirstList[2:]}")
print(f"От 6 елемент до 8: {myFirstList[5:7 + 1]}")

print()

newList = ["ябълка", "круша", "киви", "кайсия", "череша"]
copyNewList = newList.copy()  # копира списъка
print(newList)
newList[1] = "праскова"  # заменя думата с индекс 1 с новата дума
print(f"Сменяме думата круша с думата праскова: {newList}")
newList[1:3] = ["банан"]  # заменя думите от индекс 1 до 3 с новите думи
print(f"Сменяме думите от индекс 1 до 3 с новите думи: {newList}")
newList.append("ягода")  # добавя елемент в края на списъка
print(f"Добавяме думата ягода в списъка: {newList}")
myFirstList.insert(5, "много")  # добавя елемент на дадената позиция в списъка
print(f"Добавяме думата много на 5 позиция: {myFirstList}")
myFirstList.extend(newList)  # разширява текущия списък с въведения
print(f"Двата списъка обединени: {myFirstList}")
newList.remove("ябълка")  # премахва съответния елемент
print(f"Премахваме думата ябълка от списъка: {newList}")
newList.pop(1)  # премахва елемента на съответната позиция; ако НЕ е зададен индекс се премахва последния елемент
print(f"Премахваме думата на 1 позиция: {newList}")
del newList[1]  # премахва елемента на съответната позиция; ако НЕ е зададен индекс изчиства списъка
print(f"Премахваме думата на 1 позиция: {newList}")
newList.clear()  # изчиства списъка
print(f"Изчистен списък: {newList}")
copyNewList.reverse()  # обръща реда на списъка
print(f"Списъкът обърнат: {copyNewList}")
copyNewList.sort()  # сортира списъка
print(f"Сортиране на списъка по азбучен ред: {copyNewList}")
copyNewList.sort(reverse = True)  # сортира списъка в обратен ред
print(f"Сортиране на списъка в обратен ред по азбучен ред: {copyNewList}")

print("------------------------------------------------------------------")

# Кортежи: елементите са подредени, НЕ могат да се променят и може да има повтарящи се елементи
# => достъпването на елементи е, както при списъците
# => промяна на кортеж става, като първо се превърне в лист
myFirstTuple = (2, "крака", 2, "ръце")
print(myFirstTuple)

print("------------------------------------------------------------------")

# Речници: подредена съвкупност, която може да се променя и НЕ може да има повтарящи се елементи
myFirstDictionary = {"Марка": "БМВ", "Модел": "530D - Е60", "Година": 2004, "Електрическа": False, "Цветове": ["светлосив", "черен", "бял"]}
print(myFirstDictionary)
print(f"Принтирай марката: {myFirstDictionary["Марка"]}")  # в [] се поставя ключът, чиято стойност искаме да отпечатаме
keys = myFirstDictionary.keys()
values = myFirstDictionary.values()
print(f"Принтирай ключовете от речника: {keys}\nПринтирай стойностите от речника: {values}")  # след знак \n принтирането става на нов ред
items = myFirstDictionary.items()
print(f"Принтирай предметите в речника: {items}")
myFirstDictionary["Модел"] = "535D - Е60"
myFirstDictionary["Година"] = 2005
print(f"Смяна на модела и годината: {myFirstDictionary}")
myFirstDictionary["Всички екстри"] = "Да"
print(f"Добавяне на пълен пакет екстри: {myFirstDictionary}")
myFirstDictionary.pop("Електрическа")  # премахва въведения ключ с неговата стойност
print(f"Премахваме секция 'Електрическа': {myFirstDictionary}")

print()

myFamily = {"Син": {"Име": "Емилиян", "Роден": 2005}, "Дъщеря": {"Име": "Росица", "Родена": 2010}, "Майка": {"Име": "Силвия", "Родена": 1985}, "Баща": {"Име": "Георги", "Роден": 1982}}
print(myFamily)

print("------------------------------------------------------------------")

# Сетове: елементите НЕ са подредени, НЕ могат да се променят(но може да се добавят и премахват елементи) и НЕ може да има повтарящи се елементи
set1 = {3, 1, 11, 4}
set2 = {2, 4, 5, 8, 11}
print(f"{set1}\n{set2}")
print(f"Двата сета обединени: {set1.union(set2)}")  # обединява двата кета, като присъстват само елементите, които се срещат веднъж
print(f"Числата от речник1, които ги няма в речник2: {set1.difference(set2)}")  # показва различните числа от текущия сет в дадения
print(f"Числата от речник2, които ги няма в речник1: {set2.difference(set1)}")
print(f"Еднаквите числа от двата речника: {set1.intersection(set2)}")  # показва еднаквите числа от двата сета
print(f"Числата, които не се повтарят от двата речника: {set1.symmetric_difference(set2)}")  # показва числата, които НЕ се повтарят от двата сета

print()

set3 = {"Аз", "съм", "готин", True}
print(set3)
set3.add(6)  # добавя елемент към сета
print(f"Добави 6 към сета: {set3}")
set3.discard(True)  # премахва въведения елемент от сета
print(f"Премахваме True от сета: {set3}")

print("------------------------------------------------------------------")

# Функции: Функция работи единствено, ако е извикана
def myFirstFunction():
    print("Моята първа функция")

myFirstFunction()

print()

def myFunction(name, surname):  # вътре в скобите са параметри
    print(f"Име: {name} Фамилия: {surname}")

myFunction("Емилиян", "Георгиев")  # викане на функция с аргументи за параметрите
myFunction("Росица", "Георгиева")

print()

def kids(*kid):  # не се знае колко аргумента ще подаваме на параметъра
    print(f"Най-младото дете е: {kid[2]}")

kids("Йордан", "Стоян", "Максим")

print()

def kidLastName(**kid):  # не се знае колко ключове с аргументи ще подаваме на параметъра
    print(f"Фамилията на детето е: {kid["lastName"]}")

kidLastName(firstName = "Никола", secondName = "Николов", lastName = "Николов")

print()

# -> lambda функции: анонимни функции; може да има безброй аргументи, но само един резултат
total = lambda digit1, digit2: digit1 + digit2
print(f"Сбор на нещо: {total(4, 6)}")

def function(n):
    return lambda a, b: (a + b) * n

doubler = function(2)
tripler = function(3)
print(f"Удвоен сбор на нещо: {doubler(11, 11)}")
print(f"Утроен сбор на нещо: {tripler(5, 5)}")

print("------------------------------------------------------------------")

# Класове: Конструктор на обекти
class MyFirstClass:
    x = 5

firstObject = MyFirstClass()  # обект
print(firstObject.x)  # принтира обекта със стойност x
print(MyFirstClass.x)  # принтира стойността x от класа
firstObject.x = 7
print(f"Смяна на числото 5 със 7: {firstObject.x}")

print()

class Person:
    def __init__(self, name, age):  # позволява ни да променяме аргументите на обекта; параметърът self(може да бъде с друго име) се използва за достъпване на променливите от класа
        self.name = name
        self.age = age

    def __str__(self):  # контролира какво трябва да се изведе под формата на низ
        return (f"Човекът е {self.name}. На {self.age} години е")

    def greetings(self):  # функциите вътре в класовете се наричат методи
        print(f"Здравейте, името ми е {self.name}")

person = Person("Емилиян", 19)
print(person)
person.greetings()

class Student(Person):
    # pass - наследява всички функции от главния клас
    def __init__(student, name, age, gender):  # спира да наследява функциите от главния клас
        Person.__init__(student, name, age)  # 1; позволява продължаването да наследява функциите от главния клас
        student.gender = gender
        super().__init__(name, age)  # 2; работи по същия начин като # 1

    def __str__(student):
        return (f"Студентът е {student.name}, {student.gender}. На {student.age} години е")

student = Student("Георги", 19, "мъж")
print(student)
student.greetings()

print("------------------------------------------------------------------")

# Операции с файлове: open(<файл>, <режим на достъп>)
# -> Създаване: "x" => връща грешка, ако файлът вече съществува
# -> Писане: "w" => създава файл, ако такъв НЕ съществува; презаписва цялото съдържание
file = open("Тест.txt", "w")
file.write("Това е първият ред\n")
file.write("Това е вторият ред\n")
file.close()  # след приключване на операция е желателно файлът да се затвори, за да се избегнат грешки
# -> Четене: "r" => връща грешка, ако файлът НЕ съществува
file = open("Тест.txt", "r")
print(file.read())
file.close()
# -> Добавяне: "a" => създава файл, ако такъв НЕ съществува; добавя в края на съдържанието; добавя при всяко стартиране на програмата
file = open("Тест.txt", "a")
file.write("Сега файлът има трети ред\n")
file.close()

file = open("Тест.txt", "r")
print(file.read())
file.close()
# => операциите могат да бъдат комбинирани: w+ - записваме и четем, r+ - четем и записваме, a+ - добавяме и четем
file = open("Тест.txt", "a+")
fruits = ["Портокал ", "Ябълка ", "Банан"]
file.writelines(fruits)
file.seek(0)  # обхожда файлът от зададената позиция
print(file.read())
file.close()
# => двоичен режим: wb, rb, ab
text = "Край!"
with open("Тест2.txt", "wb+") as file:  # друг начин за отваряне на файл
    encoded = text.encode("utf-8")  # стандарт за символно кодиране
    file.write(encoded)
    file.seek(0)
    data = file.read()
    print(data)
    newData = data.decode("utf-8")
    print(newData)
